## Exploratory Data Analysis ##

#### Set up imports for Pandas, Matplotlib, and MySQL Connector ####

In [55]:
import pandas as pd
import matplotlib.pyplot as plt
import mysql.connector as connection

#### Use MySQL Connector to establish a connection to my remote data source ####

In [56]:
myremotedb = connection.connect(host = "devcodecamp-mysql.c5p7yvjq1h8y.us-east-2.rds.amazonaws.com", database = "salesdb", user = "root", password = "D3v$tudent", use_pure = True)

#### Query **salesdb** to JOIN the information from the *sales* and *cities* tables and save as a single data frame ####

In [57]:
joinquery = """SELECT sales.Invoice_ID,
                    sales.Customer_Type,
                    sales.Gender,
                    sales.Product_Line,
                    sales.Unit_Price,
                    sales.Quantity,
                    sales.Total,
                    sales.Date,
                    sales.Time,
                    sales.Payment,
                    sales.COGS,
                    sales.Gross_Income,
                    sales.rating,
                    cities.City 
                    FROM sales 
                    JOIN cities 
                    ON sales.City_ID = cities.City_ID"""
joined_df = pd.read_sql_query(joinquery, myremotedb)

C:\Users\Owner\AppData\Local\Temp\ipykernel_420\2554617612.py:18: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  joined_df = pd.read_sql_query(joinquery, myremotedb)

#### Perform necessary data cleaning and wrangling steps on Joined DataFrame ####

* Explore the information of the DataFrame

In [58]:
joined_df.head()

,Invoice_ID,Customer_Type,Gender,Product_Line,Unit_Price,Quantity,Total,Date,Time,Payment,COGS,Gross_Income,rating,City
0,101-17-6199,Normal,Male,Food and beverages,45.79,7,336.5565,3/13/2019,19:44,Credit card,320.53,16.0265,7.0,Seattle
1,101-81-4070,Member,Female,Health and beauty,62.82,2,131.9220,1/17/2019,12:36,Ewallet,125.64,6.2820,4.9,Milwaukee
2,102-06-2002,Member,Male,Sports and travel,25.25,5,132.5625,3/20/2019,17:52,Cash,126.25,6.3125,6.1,Milwaukee
3,102-77-2261,Member,Male,Health and beauty,65.31,7,480.0285,3/5/2019,18:02,Credit card,457.17,22.8585,4.2,Milwaukee
4,105-10-6182,Member,Male,Fashion accessories,21.48,2,45.1080,2/27/2019,12:22,Ewallet,42.96,2.1480,6.6,Seattle

* Check for null values

In [60]:
joined_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 14 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Invoice_ID     1000 non-null   object
 1   Customer_Type  1000 non-null   object
 2   Gender         1000 non-null   object
 3   Product_Line   1000 non-null   object
 4   Unit_Price     1000 non-null   float64
 5   Quantity       1000 non-null   int64
 6   Total          1000 non-null   float64
 7   Date           1000 non-null   object
 8   Time           1000 non-null   object
 9   Payment        1000 non-null   object
 10  COGS           1000 non-null   float64
 11  Gross_Income   1000 non-null   float64
 12  rating         1000 non-null   float64
 13  City           1000 non-null   object
dtypes: float64(5), int64(1), object(8)
memory usage: 109.5+ KB

* Check for duplicates

In [66]:
joined_df.duplicated().sort_values()

0      False
658    False
659    False
660    False
661    False
       ...
339    False
340    False
341    False
328    False
999    False
Length: 1000, dtype: bool

* Convert any necessary columns to Panda DateTime format